<template>
  <navbar title="更新日志" can-return />

  <van-tabs v-model:active="active" scrollspy sticky offset-top="46">
    <div class="content">
      <van-tab title="22/05/26">
        <h2>2022 年 05 月 26 日</h2>
        <h3>功能与改进</h3>
        <p>1. 羁梦星愿模拟器：加入。</p>
        <p>2. 调整首页布局。</p>
        <p>3. 改进了部分文字提示与 UI 样式。</p>
        <h3>问题修复</h3>
        <p>
          1.
          信使花园模拟器：修复限定卡池「春意渐浓」「昔年依旧」「守望之境」「欲望花都」「遨游彼界」中限定灵犀可兑换次数数据配置有误的问题。
        </p>
        <p>
          2. 信使花园模拟器：修复限定卡池「浮世同行 / 剪影」中 UP
          概率、水位继承配置有误的问题。
        </p>
        <p>
          3. 信使花园模拟器：修复限定卡池「被奴役的心 / 归途」「六号病房 /
          归途」时间配置有误的问题。
        </p>
      </van-tab>
      <van-tab title="22/05/25">
        <h2>2022 年 05 月 25 日</h2>
        <h3>功能与改进</h3>
        <p>1. 适配深色模式。</p>
        <h3>问题修复</h3>
        <p>1. 活动提醒：修复周期事件在非北京时间下时间计算错误的问题。</p>
      </van-tab>
      <van-tab title="22/05/24">
        <h2>2022 年 05 月 24 日</h2>
        <h3>功能与改进</h3>
        <p>1. 信使花园模拟器：改进收信动画样式 2，添加可选的发光效果。</p>
        <p>2. 改进了部分文字提示与 UI 样式。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：移除已结束的「与他的丛林密语」活动信息。</p>
        <h3>问题修复</h3>
        <p>
          1. 信使花园模拟器：修复常驻卡池「浮世同行・六号病房 /
          听不见的呼救」及其相关限定卡池中四星灵犀数据配置有误的问题。
        </p>
        <p>
          2.
          信使花园模拟器：添加常驻卡池「浮世同行・与罪同行」，修复限定卡池「遨游彼界」中常驻部分数据配置有误的问题。
        </p>
      </van-tab>
      <van-tab title="22/05/23">
        <h2>2022 年 05 月 23 日</h2>
        <h3>功能与改进</h3>
        <p>1. 羁梦星愿计算器：修改部分文字提示。</p>
        <h3>数据更新</h3>
        <p>
          1. 活动提醒：移除已结束的「悠游夏日」「与罪同行 /
          归途」「外婆小铺双倍掉落」活动信息。
        </p>
        <h3>问题修复</h3>
        <p>
          1.
          活动提醒：尝试修复进入子页面再返回首页后，周期活动时间计算错误的问题。
        </p>
      </van-tab>
      <van-tab title="22/05/22">
        <h2>2022 年 05 月 22 日</h2>
        <h3>功能与改进</h3>
        <p>
          1.
          信使花园模拟器：添加「倾昼之夜」「尘封的雪影」「日日夜夜」卡池的特殊机制。
        </p>
        <p>2. 信使花园模拟器：添加可选的实验性动画效果。</p>
        <p>3. 活动提醒：修改即将结束的周期活动的样式。</p>
        <p>4. 添加到主屏幕：加入。在此感谢微博网友建议。</p>
        <p>5. 改进了部分文字提示与 UI 样式。</p>
        <h3>数据更新</h3>
        <p>
          1. 信使花园模拟器：添加 2021 年原定七夕限定卡池「倾昼之夜」的数据。
        </p>
        <h3>问题修复</h3>
        <p>
          1. 修复 <code>manifest.json</code> 被我打错成
          <code>manifect.json</code> 导致 PWA 不能正常生效的问题。
        </p>
        <p>2. 活动提醒：修复剩余小时数为 0 时天数不显示的问题。</p>
        <p>3. 羁梦星愿计算器：修复可选活动开始日期范围错误的问题。</p>
      </van-tab>
      <van-tab title="22/05/21">
        <h2>2022 年 05 月 21 日</h2>
        <h3>功能与改进</h3>
        <p>1. 首页：改进首页 UI 样式。</p>
        <p>
          2. 活动提醒：由横幅提示修改为独立页面，并改进 UI
          样式。在此感谢微博网友建议。
        </p>
        <p>3. 信使花园模拟器：添加心迹书简与限定书简兑换灵犀功能。</p>
        <p>4. 添加 PWA 支持。</p>
        <p>5. 改进了部分文字提示与 UI 样式。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：添加「真心话大冒险」第 12 期活动信息。</p>
        <h3>问题修复</h3>
        <p>
          1.
          囤囤鼠计算器：修复可选日期范围错误的问题。在此感谢微博网友发现问题。
        </p>
      </van-tab>
      <van-tab title="22/05/20">
        <h2>2022 年 05 月 20 日及之前</h2>
        <h3>功能与改进</h3>
        <p>1. 活动提醒：加入。</p>
        <p>2. 囤囤鼠计算器：加入。</p>
        <p>3. 礼包性价比计算器：加入。</p>
        <p>4. 道具合成计算器：加入。</p>
        <p>5. 信使花园模拟器：加入。</p>
        <p>6. 羁梦星愿计算器：加入。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：添加 2022 年夏鸣星生日系列活动信息。</p>
        <h3>问题修复</h3>
        <p>1. 活动提醒：修复非北京时间下时间计算错误的问题。</p>
        <p>
          2.
          羁梦星愿计算器：修复在输入框中输入数据再删除后，默认值无法正常生效的问题。
        </p>
      </van-tab>
    </div>
  </van-tabs>
</template>

<script>
import Navbar from '@/components/Navbar.vue'

export default {
  name: 'ChangeLog',
  components: {
    Navbar,
  },
  data() {
    return {
      active: 0,
    }
  },
}
</script>
