<template>
  <navbar title="更新日志" can-return />

  <van-tabs v-model:active="active" scrollspy sticky offset-top="46">
    <div class="content">
      <van-tab title="y22w29">
        <h2>2022 年第 29 周</h2>
        <h3>功能与改进</h3>
        <p>1. 为部分页面新增（日后可能会有的）多语言与多服务器功能的支持。</p>
        <p>2. 新增（被藏起来的）开发人员选项。</p>
        <p>3. 改进了部分页面的布局、文字提示与显示效果。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
      </van-tab>
      <van-tab title="y22w28">
        <h2>2022 年第 28 周</h2>
        <h3>功能与改进</h3>
        <p>1. 新增于 Vercel 部署的镜像。</p>
        <p>2. 新增 PWA 支持，新通过 Chrome / Safari 浏览器将网页添加到桌面，即可缓存以供离线使用。</p>
        <p>3. 改进了部分页面的布局、文字提示与显示效果。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <p>2. 信使花园模拟器：添加限定卡池「夏令赋格曲」。</p>
      </van-tab>
      <van-tab title="y22w27">
        <h2>2022 年第 27 周</h2>
        <h3>功能与改进</h3>
        <p>1. 欧皇模拟器：优化图片画质；简化操作；加入对「瑰意」纪念标记的支持。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <p>2. 信使花园模拟器：添加常驻卡池「浮世同行・失败者的失败」。</p>
      </van-tab>
      <van-tab title="y22w26">
        <h2>2022 年第 26 周</h2>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <p>2. 信使花园模拟器：添加限定卡池「时间的彼岸・同光」「时间的彼岸・共影」。</p>
      </van-tab>
      <van-tab title="y22w23">
        <h2>2022 年第 23 周</h2>
        <h3>功能与改进</h3>
        <p>1. 灵犀养成计算器：首次加入。在此感谢 @Gabbia白鸦 分享的升级材料数据，以及微博网友的建议。</p>
        <p>2. 囤囤鼠计算器：加入对月卡「祈愿勾勾」的支持。</p>
        <p>3. 信使花园模拟器：将动画效果相关设置项改为持久化存储。感谢微博网友的建议。</p>
        <p>4. 羁梦星愿模拟器：将动画速度相关设置项改为持久化存储。</p>
        <p>5. 礼包性价比计算器：加入列表功能。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <p>2. 信使花园模拟器：添加信使攻略站「繁花与序章」攻略链接。在此感谢信使攻略站。</p>
      </van-tab>
      <van-tab title="y22w22">
        <h2>2022 年第 22 周</h2>
        <h3>功能与改进</h3>
        <p>1. 欧皇模拟器：首次加入。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <p>2. 信使花园模拟器：添加限定卡池「繁花与序章」。</p>
        <h3>问题修复</h3>
        <p>1. 修复加载提示有时不会消失的问题。</p>
      </van-tab>
      <van-tab title="y22w21">
        <h2>2022 年第 21 周</h2>
        <h3>功能与改进</h3>
        <p>1. 羁梦星愿模拟器：首次加入。</p>
        <p>2. 信使花园模拟器：添加可选的动画效果与发光效果；支持「倾昼之夜」「尘封的雪影」「日日夜夜」卡池的特殊机制。</p>
        <p>3. 适配深色模式。</p>
        <p>4. 改进了部分页面的布局、文字提示与显示效果。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <p>2. 信使花园模拟器：添加常驻卡池「浮世同行・与罪同行」、限定卡池「倾昼之夜」。</p>
        <h3>问题修复</h3>
        <p>1. 活动提醒：修复非北京时间下及路由跳转后活动时间计算错误的问题。修复剩余小时数为 0 时天数不显示的问题。</p>
        <p>2. 信使花园模拟器：修正部分卡池的错误数据。</p>
        <p>3. 羁梦星愿计算器：修复可选活动开始日期范围错误的问题。</p>
        <p>4. 羁梦星愿模拟器：修复在低速下许愿后，无法正常将动画切换到高速的问题。</p>
      </van-tab>
      <van-tab title="y22w20">
        <h2>2022 年第 20 周</h2>
        <h3>功能与改进</h3>
        <p>1. 活动提醒：首次加入。</p>
        <p>2. 囤囤鼠计算器：首次加入。</p>
        <p>3. 礼包性价比计算器：首次加入。</p>
        <p>4. 道具合成计算器：首次加入。</p>
        <p>5. 信使花园模拟器：首次加入。</p>
        <p>6. 羁梦星愿计算器：首次加入。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：活动数据已更新至最新。</p>
        <h3>问题修复</h3>
        <p>1. 囤囤鼠计算器：修复可选日期范围错误的问题。在此感谢微博网友发现问题。</p>
        <p>2. 羁梦星愿计算器：修复在输入框中输入数据再删除后，默认值无法正常生效的问题。</p>
      </van-tab>
    </div>
  </van-tabs>
</template>

<script>
import Navbar from '@/components/Navbar.vue'

export default {
  name: 'ChangeLog',
  components: {
    Navbar,
  },
  data() {
    return {
      active: 0,
    }
  },
}
</script>
