<template>
  <navbar title="更新日志" can-return />

  <van-tabs v-model:active="active" scrollspy sticky offset-top="46">
    <div class="content">
      <van-tab title="y22w26">
        <h2>2022 年第 26 周</h2>
        <h3>数据更新</h3>
        <p>1. 活动提醒：移除已结束的「真心话大冒险」第 12 期、「设计专栏」第 5 期活动信息，添加「羁梦星愿・绯红深渊」「星雾谜戏・绯红深渊」活动信息。</p>
      </van-tab>
      <van-tab title="y22w23">
        <h2>2022 年第 23 周</h2>
        <h3>功能与改进</h3>
        <p>1. 灵犀养成计算器：首次加入。在此感谢 @Gabbia白鸦 分享的升级材料数据，以及微博网友的建议。</p>
        <p>2. 囤囤鼠计算器：加入对月卡「祈愿勾勾」的支持。</p>
        <p>3. 信使花园模拟器：将动画效果相关设置项改为持久化存储。感谢微博网友的建议。</p>
        <p>4. 羁梦星愿模拟器：将动画速度相关设置项改为持久化存储。</p>
        <p>5. 礼包性价比计算器：加入列表功能。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：移除已结束的「异日徜欢」活动信息，添加「真心话大冒险」第 13 期活动信息。</p>
        <p>2. 信使花园模拟器：添加信使攻略站「繁花与序章」攻略链接。在此感谢信使攻略站。</p>
      </van-tab>
      <van-tab title="y22w22">
        <h2>2022 年第 22 周</h2>
        <h3>功能与改进</h3>
        <p>1. 欧皇模拟器：首次加入。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：移除已结束的 2022 年夏鸣星生日系列活动信息，添加「异日徜欢」「仲夏庆典」活动信息。</p>
        <p>2. 信使花园模拟器：添加限定卡池「繁花与序章」。</p>
        <h3>问题修复</h3>
        <p>1. 修复加载提示有时不会消失的问题。</p>
      </van-tab>
      <van-tab title="y22w21">
        <h2>2022 年第 21 周</h2>
        <h3>功能与改进</h3>
        <p>1. 羁梦星愿模拟器：首次加入。</p>
        <p>2. 信使花园模拟器：添加可选的动画效果与发光效果；支持「倾昼之夜」「尘封的雪影」「日日夜夜」卡池的特殊机制。</p>
        <p>3. 适配深色模式。</p>
        <p>4. 改进了部分页面的布局、文字提示与显示效果。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：移除已结束的「悠游夏日」「与他的丛林密语」「与罪同行 / 归途」「外婆小铺双倍掉落」活动信息。</p>
        <p>2. 信使花园模拟器：添加常驻卡池「浮世同行・与罪同行」、限定卡池「倾昼之夜」。</p>
        <h3>问题修复</h3>
        <p>1. 活动提醒：修复非北京时间下及路由跳转后活动时间计算错误的问题。修复剩余小时数为 0 时天数不显示的问题。</p>
        <p>2. 信使花园模拟器：修正部分卡池的错误数据。</p>
        <p>3. 羁梦星愿计算器：修复可选活动开始日期范围错误的问题。</p>
        <p>4. 羁梦星愿模拟器：修复在低速下许愿后，无法正常将动画切换到高速的问题。</p>
      </van-tab>
      <van-tab title="y22w20">
        <h2>2022 年第 20 周</h2>
        <h3>功能与改进</h3>
        <p>1. 活动提醒：首次加入。</p>
        <p>2. 囤囤鼠计算器：首次加入。</p>
        <p>3. 礼包性价比计算器：首次加入。</p>
        <p>4. 道具合成计算器：首次加入。</p>
        <p>5. 信使花园模拟器：首次加入。</p>
        <p>6. 羁梦星愿计算器：首次加入。</p>
        <h3>数据更新</h3>
        <p>1. 活动提醒：添加 2022 年夏鸣星生日系列活动、「真心话大冒险」第 12 期活动信息。</p>
        <h3>问题修复</h3>
        <p>1. 囤囤鼠计算器：修复可选日期范围错误的问题。在此感谢微博网友发现问题。</p>
        <p>2. 羁梦星愿计算器：修复在输入框中输入数据再删除后，默认值无法正常生效的问题。</p>
      </van-tab>
    </div>
  </van-tabs>
</template>

<script>
import Navbar from '@/components/Navbar.vue'

export default {
  name: 'ChangeLog',
  components: {
    Navbar,
  },
  data() {
    return {
      active: 0,
    }
  },
}
</script>
